//--------------------------------------------------------------
// File name:   filer.c
//--------------------------------------------------------------
#include "launchelf.h"

typedef struct
{
    unsigned char unknown;
    unsigned char sec;    // date/time (second)
    unsigned char min;    // date/time (minute)
    unsigned char hour;   // date/time (hour)
    unsigned char day;    // date/time (day)
    unsigned char month;  // date/time (month)
    unsigned short year;  // date/time (year)
} PS2TIME __attribute__((aligned(2)));

#define MC_SFI 0xFEED  // flag value used for mcSetFileInfo at MC file restoration

#define MC_ATTR_norm_folder 0x8427  // Normal folder on PS2 MC
#define MC_ATTR_prot_folder 0x842F  // Protected folder on PS2 MC
#define MC_ATTR_PS1_folder  0x9027  // PS1 save folder on PS2 MC
#define MC_ATTR_norm_file   0x8497  // file (PS2/PS1) on PS2 MC
#define MC_ATTR_PS1_file    0x9417  // PS1 save file on PS1 MC

#define IOCTL_RENAME 0xFEEDC0DE  // Ioctl request code for Rename function

enum {
    COPY,
    CUT,
    PASTE,
    MCPASTE,
    PSUPASTE,
    DELETE,
    RENAME,
    NEWDIR,
    NEWICON,
    MOUNTVMC0,
    MOUNTVMC1,
    GETSIZE,
    NUM_MENU
} R1_menu_enum;

#define PM_NORMAL      0   // PasteMode value for normal copies
#define PM_MC_BACKUP   1   // PasteMode value for gamesave backup from MC
#define PM_MC_RESTORE  2   // PasteMode value for gamesave restore to MC
#define PM_PSU_BACKUP  3   // PasteMode value for gamesave backup from MC to PSU
#define PM_PSU_RESTORE 4   // PasteMode value for gamesave restore to MC from PSU
#define PM_RENAME      5   // PasteMode value for normal copies with new names
#define MAX_RECURSE    16  // Maximum folder recursion for MC Backup/Restore

int PasteProgress_f = 0;   // Flags progress report having been made in Pasting
int PasteMode;             // Top-level PasteMode flag
int PM_flag[MAX_RECURSE];  // PasteMode flag for each 'copy' recursion level
int PM_file[MAX_RECURSE];  // PasteMode attribute file descriptors

char mountedParty[MOUNT_LIMIT][MAX_NAME];
int latestMount = -1;
char mountedDVRPParty[MOUNT_LIMIT][MAX_NAME];
int latestDVRPMount = -1;
int vmcMounted[2] = {0, 0};                          // flags true for mounted VMC false for unmounted
int vmc_PartyIndex[2] = {-1, -1};                    // PFS index for each VMC, unless -1
int Party_vmcIndex[MOUNT_LIMIT] = {-1, -1, -1, -1};  // VMC for each PFS, unless -1
unsigned char *elisaFnt = NULL;
int elisa_failed = FALSE;  // Set at failure to load font, cleared at browser entry
u64 freeSpace;
int mcfreeSpace;
int mctype_PSx;  // dlanor: Needed for proper scaling of mcfreespace
int vfreeSpace;  // flags validity of freespace value
int browser_cut;
int nclipFiles, nmarks, nparties, ndvrpparties;
int file_show = 1;  // dlanor: 0==name_only, 1==name+size+time, 2==title+size+time
int file_sort = 1;  // dlanor: 0==none, 1==name, 2==title, 3==mtime
int size_valid = 0;
int time_valid = 0;
char parties[MAX_PARTITIONS][MAX_PART_NAME + 1];
char clipPath[MAX_PATH], LastDir[MAX_NAME], marks[MAX_ENTRY];
FILEINFO clipFiles[MAX_ENTRY];
int fileMode = FIO_S_IRUSR | FIO_S_IWUSR | FIO_S_IXUSR | FIO_S_IRGRP | FIO_S_IWGRP | FIO_S_IXGRP | FIO_S_IROTH | FIO_S_IWOTH | FIO_S_IXOTH;

char cnfmode_extU[CNFMODE_CNT][4] = {
    "*",    // cnfmode FALSE
    "ELF",  // cnfmode TRUE
    "IRX",  // cnfmode USBD_IRX_CNF
    "JPG",  // cnfmode SKIN_CNF
    "JPG",  // cnfmode GUI_SKIN_CNF
    "IRX",  // cnfmode USBKBD_IRX_CNF
    "KBD",  // cnfmode KBDMAP_FILE_CNF
    "CNF",  // cnfmode CNF_PATH_CNF
    "*",    // cnfmode TEXT_CNF
    "",     // cnfmode DIR_CNF
    "JPG",  // cnfmode JPG_CNF
    "IRX",  // cnfmode USBMASS_IRX_CNF
    "LNG",  // cnfmode LANG_CNF
    "FNT",  // cnfmode FONT_CNF
    "*"     // cnfmode SAVE_CNF
};

char cnfmode_extL[CNFMODE_CNT][4] = {
    "*",    // cnfmode FALSE
    "elf",  // cnfmode TRUE
    "irx",  // cnfmode USBD_IRX_CNF
    "jpg",  // cnfmode SKIN_CNF
    "jpg",  // cnfmode GUI_SKIN_CNF
    "irx",  // cnfmode USBKBD_IRX_CNF
    "kbd",  // cnfmode KBDMAP_FILE_CNF
    "cnf",  // cnfmode CNF_PATH_CNF
    "*",    // cnfmode TEXT_CNF
    "",     // cnfmode DIR_CNF
    "jpg",  // cnfmode JPG_CNF
    "irx",  // cnfmode USBMASS_IRX_CNF
    "lng",  // cnfmode LANG_CNF
    "fnt",  // cnfmode FONT_CNF
    "*"     // cnfmode SAVE_CNF
};

int host_ready = 0;
int host_error = 0;
int host_elflist = 0;
int host_use_Bsl = 1;  // By default assume that host paths use backslash

unsigned long written_size;  // Used for pasting progress report
u64 PasteTime;               // Used for pasting progress report

typedef struct
{
    u8 unused;
    u8 sec;
    u8 min;
    u8 hour;
    u8 day;
    u8 month;
    u16 year;
} ps2time;

typedef struct
{                       // Offs:  Example content
    ps2time cTime;      // 0x00:  8 bytes creation timestamp (struct above)
    ps2time mTime;      // 0x08:  8 bytes modification timestamp (struct above)
    u32 size;           // 0x10:  file size
    u16 attr;           // 0x14:  0x8427  (=normal folder, 8497 for normal file)
    u16 unknown_1_u16;  // 0x16:  2 zero bytes
    u64 unknown_2_u64;  // 0x18:  8 zero bytes
    u8 name[32];        // 0x20:  32 name bytes, padded with zeroes
} mcT_header __attribute__((aligned(64)));

typedef struct
{                                   // Offs:  Example content
    u16 attr;                       // 0x00:  0x8427  (=normal folder, 8497 for normal file)
    u16 unknown_1_u16;              // 0x02:  2 zero bytes
    u32 size;                       // 0x04:  header_count-1, file size, 0 for pseudo
    ps2time cTime;                  // 0x08:  8 bytes creation timestamp (struct above)
    u64 EMS_used_u64;               // 0x10:  8 zero bytes (but used by EMS)
    ps2time mTime;                  // 0x18:  8 bytes modification timestamp (struct above)
    u64 unknown_2_u64;              // 0x20:  8 bytes from mcTable
    u8 unknown_3_24_bytes[24];      // 0x28:  24 zero bytes
    u8 name[32];                    // 0x40:  32 name bytes, padded with zeroes
    u8 unknown_4_416_bytes[0x1A0];  // 0x60:  zero byte padding to reach 0x200 size
} psu_header;                       // 0x200: End of psu_header struct

int PSU_content;  // Used to count PSU content headers for the main header

// USB_mass definitions for multiple drive usage
char USB_mass_ix[10] = {'0', 0, 0, 0, 0, 0, 0, 0, 0, 0};
int USB_mass_max_drives = USB_MASS_MAX_DRIVES;
u64 USB_mass_scan_time = 0;
int USB_mass_scanned = 0;  // 0==Not_found_OR_No_Multi 1==found_Multi_mass_once
int USB_mass_loaded = 0;   // 0==none, 1==internal, 2==external


// char debugs[4096]; //For debug display strings. Comment it out when unused
//--------------------------------------------------------------
// executable code
//--------------------------------------------------------------
void clear_mcTable(sceMcTblGetDir *mcT)
{
    memset((void *)mcT, 0, sizeof(sceMcTblGetDir));
}
//--------------------------------------------------------------
void clear_psu_header(psu_header *psu)
{
